{"<ingred>151-proof-rum</ingred>": 1, "<ingred>7-up</ingred>": 2, "<ingred>absinthe</ingred>": 3, "<ingred>absolut-citron</ingred>": 4, "<ingred>absolut-kurant</ingred>": 5, "<ingred>absolut-peppar</ingred>": 6, "<ingred>absolut-vodka</ingred>": 7, "<ingred>advocaat</ingred>": 8, "<ingred>agave-syrup</ingred>": 9, "<ingred>ale</ingred>": 10, "<ingred>amaretto</ingred>": 11, "<ingred>amaro-montenegro</ingred>": 12, "<ingred>angostura-bitters</ingred>": 13, "<ingred>anis</ingred>": 14, "<ingred>anise</ingred>": 15, "<ingred>anisette</ingred>": 16, "<ingred>aperol</ingred>": 17, "<ingred>apfelkorn</ingred>": 18, "<ingred>apple-brandy</ingred>": 19, "<ingred>apple-juice</ingred>": 20, "<ingred>apple-schnapps</ingred>": 21, "<ingred>apple</ingred>": 22, "<ingred>applejack</ingred>": 23, "<ingred>apricot-brandy</ingred>": 24, "<ingred>apricot-nectar</ingred>": 25, "<ingred>a\u00f1ejo-rum</ingred>": 26, "<ingred>bacardi-limon</ingred>": 27, "<ingred>baileys-irish-cream</ingred>": 28, "<ingred>banana-liqueur</ingred>": 29, "<ingred>banana</ingred>": 30, "<ingred>basil</ingred>": 31, "<ingred>beer</ingred>": 32, "<ingred>benedictine</ingred>": 33, "<ingred>berries</ingred>": 34, "<ingred>bitter-lemon</ingred>": 35, "<ingred>bitters</ingred>": 36, "<ingred>blackberries</ingred>": 37, "<ingred>blackberry-brandy</ingred>": 38, "<ingred>blackstrap-rum</ingred>": 39, "<ingred>blended-scotch</ingred>": 40, "<ingred>blended-whiskey</ingred>": 41, "<ingred>blood-orange</ingred>": 42, "<ingred>blue-curacao</ingred>": 43, "<ingred>blueberries</ingred>": 44, "<ingred>bourbon</ingred>": 45, "<ingred>brandy</ingred>": 46, "<ingred>brown-sugar</ingred>": 47, "<ingred>butterscotch-schnapps</ingred>": 48, "<ingred>cachaca</ingred>": 49, "<ingred>campari</ingred>": 50, "<ingred>candy</ingred>": 51, "<ingred>cantaloupe</ingred>": 52, "<ingred>carbonated-water</ingred>": 53, "<ingred>cardamom</ingred>": 54, "<ingred>celery-salt</ingred>": 55, "<ingred>chambord-raspberry-liqueur</ingred>": 56, "<ingred>champagne</ingred>": 57, "<ingred>cherry-brandy</ingred>": 58, "<ingred>cherry-heering</ingred>": 59, "<ingred>cherry-juice</ingred>": 60, "<ingred>cherry</ingred>": 61, "<ingred>chocolate-ice-cream</ingred>": 62, "<ingred>chocolate-liqueur</ingred>": 63, "<ingred>chocolate-sauce</ingred>": 64, "<ingred>cinnamon</ingred>": 65, "<ingred>cloves</ingred>": 66, "<ingred>club-soda</ingred>": 67, "<ingred>coca-cola</ingred>": 68, "<ingred>coconut-liqueur</ingred>": 69, "<ingred>coconut-milk</ingred>": 70, "<ingred>coconut-rum</ingred>": 71, "<ingred>coffee-brandy</ingred>": 72, "<ingred>coffee-liqueur</ingred>": 73, "<ingred>coffee</ingred>": 74, "<ingred>cognac</ingred>": 75, "<ingred>cointreau</ingred>": 76, "<ingred>condensed-milk</ingred>": 77, "<ingred>coriander</ingred>": 78, "<ingred>corona</ingred>": 79, "<ingred>cranberry-juice</ingred>": 80, "<ingred>cranberry-vodka</ingred>": 81, "<ingred>cream-of-coconut</ingred>": 82, "<ingred>cream</ingred>": 83, "<ingred>creme-de-banane</ingred>": 84, "<ingred>creme-de-cacao</ingred>": 85, "<ingred>creme-de-cassis</ingred>": 86, "<ingred>creme-de-mure</ingred>": 87, "<ingred>crown-royal</ingred>": 88, "<ingred>cucumber</ingred>": 89, "<ingred>curacao</ingred>": 90, "<ingred>dark-rum</ingred>": 91, "<ingred>demerara-sugar</ingred>": 92, "<ingred>dr</ingred>": 93, "<ingred>drambuie</ingred>": 94, "<ingred>dry-vermouth</ingred>": 95, "<ingred>dubonnet-rouge</ingred>": 96, "<ingred>egg-white</ingred>": 97, "<ingred>egg-yolk</ingred>": 98, "<ingred>egg</ingred>": 99, "<ingred>elderflower-cordial</ingred>": 100, "<ingred>erin-cream</ingred>": 101, "<ingred>espresso</ingred>": 102, "<ingred>everclear</ingred>": 103, "<ingred>falernum</ingred>": 104, "<ingred>figs</ingred>": 105, "<ingred>firewater</ingred>": 106, "<ingred>frangelico</ingred>": 107, "<ingred>fresh-lemon-juice</ingred>": 108, "<ingred>fresh-lime-juice</ingred>": 109, "<ingred>fruit-punch</ingred>": 110, "<ingred>galliano</ingred>": 111, "<ingred>gin</ingred>": 112, "<ingred>ginger-ale</ingred>": 113, "<ingred>ginger-beer</ingred>": 114, "<ingred>ginger-syrup</ingred>": 115, "<ingred>ginger</ingred>": 116, "<ingred>godiva-liqueur</ingred>": 117, "<ingred>gold-rum</ingred>": 118, "<ingred>gold-tequila</ingred>": 119, "<ingred>goldschlager</ingred>": 120, "<ingred>grain-alcohol</ingred>": 121, "<ingred>grand-marnier</ingred>": 122, "<ingred>grape-juice</ingred>": 123, "<ingred>grape-soda</ingred>": 124, "<ingred>grapefruit-juice</ingred>": 125, "<ingred>grapes</ingred>": 126, "<ingred>green-chartreuse</ingred>": 127, "<ingred>green-creme-de-menthe</ingred>": 128, "<ingred>grenadine</ingred>": 129, "<ingred>guinness-stout</ingred>": 130, "<ingred>half-and-half</ingred>": 131, "<ingred>heavy-cream</ingred>": 132, "<ingred>honey-syrup</ingred>": 133, "<ingred>honey</ingred>": 134, "<ingred>hot-chocolate</ingred>": 135, "<ingred>hot-damn</ingred>": 136, "<ingred>hpnotiq</ingred>": 137, "<ingred>ice</ingred>": 138, "<ingred>iced-tea</ingred>": 139, "<ingred>irish-cream</ingred>": 140, "<ingred>irish-whiskey</ingred>": 141, "<ingred>islay-single-malt-scotch</ingred>": 142, "<ingred>jack-daniels</ingred>": 143, "<ingred>jim-beam</ingred>": 144, "<ingred>j\u00e4germeister</ingred>": 145, "<ingred>kahlua</ingred>": 146, "<ingred>kirschwasser</ingred>": 147, "<ingred>kiwi-liqueur</ingred>": 148, "<ingred>kiwi</ingred>": 149, "<ingred>kool-aid</ingred>": 150, "<ingred>kummel</ingred>": 151, "<ingred>lager</ingred>": 152, "<ingred>lavender</ingred>": 153, "<ingred>lemon-juice</ingred>": 154, "<ingred>lemon-lime-soda</ingred>": 155, "<ingred>lemon-peel</ingred>": 156, "<ingred>lemon-vodka</ingred>": 157, "<ingred>lemon</ingred>": 158, "<ingred>lemonade</ingred>": 159, "<ingred>licorice-root</ingred>": 160, "<ingred>light-cream</ingred>": 161, "<ingred>light-rum</ingred>": 162, "<ingred>lillet-blanc</ingred>": 163, "<ingred>lillet</ingred>": 164, "<ingred>lime-juice-cordial</ingred>": 165, "<ingred>lime-juice</ingred>": 166, "<ingred>lime-peel</ingred>": 167, "<ingred>lime-vodka</ingred>": 168, "<ingred>lime</ingred>": 169, "<ingred>limeade</ingred>": 170, "<ingred>malibu-rum</ingred>": 171, "<ingred>mango</ingred>": 172, "<ingred>maple-syrup</ingred>": 173, "<ingred>maraschino-cherry</ingred>": 174, "<ingred>maraschino-liqueur</ingred>": 175, "<ingred>melon-liqueur</ingred>": 176, "<ingred>mezcal</ingred>": 177, "<ingred>midori-melon-liqueur</ingred>": 178, "<ingred>milk</ingred>": 179, "<ingred>mint</ingred>": 180, "<ingred>mountain-dew</ingred>": 181, "<ingred>nutmeg</ingred>": 182, "<ingred>olive</ingred>": 183, "<ingred>orange-bitters</ingred>": 184, "<ingred>orange-curacao</ingred>": 185, "<ingred>orange-juice</ingred>": 186, "<ingred>orange-peel</ingred>": 187, "<ingred>orange-spiral</ingred>": 188, "<ingred>orange</ingred>": 189, "<ingred>oreo-cookie</ingred>": 190, "<ingred>orgeat-syrup</ingred>": 191, "<ingred>ouzo</ingred>": 192, "<ingred>papaya</ingred>": 193, "<ingred>passion-fruit-juice</ingred>": 194, "<ingred>passion-fruit-syrup</ingred>": 195, "<ingred>passoa</ingred>": 196, "<ingred>peach-bitters</ingred>": 197, "<ingred>peach-brandy</ingred>": 198, "<ingred>peach-nectar</ingred>": 199, "<ingred>peach-schnapps</ingred>": 200, "<ingred>peachtree-schnapps</ingred>": 201, "<ingred>pepper</ingred>": 202, "<ingred>pepsi-cola</ingred>": 203, "<ingred>pernod</ingred>": 204, "<ingred>peychaud-bitters</ingred>": 205, "<ingred>pineapple-juice</ingred>": 206, "<ingred>pineapple-syrup</ingred>": 207, "<ingred>pineapple</ingred>": 208, "<ingred>pisang-ambon</ingred>": 209, "<ingred>pisco</ingred>": 210, "<ingred>pomegranate-juice</ingred>": 211, "<ingred>port</ingred>": 212, "<ingred>powdered-sugar</ingred>": 213, "<ingred>prosecco</ingred>": 214, "<ingred>raspberry-liqueur</ingred>": 215, "<ingred>raspberry-syrup</ingred>": 216, "<ingred>raspberry-vodka</ingred>": 217, "<ingred>red-chili-flakes</ingred>": 218, "<ingred>red-wine</ingred>": 219, "<ingred>ricard</ingred>": 220, "<ingred>root-beer</ingred>": 221, "<ingred>rosemary-syrup</ingred>": 222, "<ingred>rosemary</ingred>": 223, "<ingred>rosso-vermouth</ingred>": 224, "<ingred>ruby-port</ingred>": 225, "<ingred>rum</ingred>": 226, "<ingred>rye-whiskey</ingred>": 227, "<ingred>salt</ingred>": 228, "<ingred>salted-chocolate</ingred>": 229, "<ingred>sambuca</ingred>": 230, "<ingred>sarsaparilla</ingred>": 231, "<ingred>schweppes-russchian</ingred>": 232, "<ingred>scotch</ingred>": 233, "<ingred>sherry</ingred>": 234, "<ingred>sloe-gin</ingred>": 235, "<ingred>soda-water</ingred>": 236, "<ingred>sour-mix</ingred>": 237, "<ingred>southern-comfort</ingred>": 238, "<ingred>spiced-rum</ingred>": 239, "<ingred>sprite</ingred>": 240, "<ingred>st</ingred>": 241, "<ingred>strawberries</ingred>": 242, "<ingred>strawberry-liqueur</ingred>": 243, "<ingred>strawberry-schnapps</ingred>": 244, "<ingred>sugar-syrup</ingred>": 245, "<ingred>sugar</ingred>": 246, "<ingred>surge</ingred>": 247, "<ingred>sweet-and-sour</ingred>": 248, "<ingred>sweet-vermouth</ingred>": 249, "<ingred>tabasco-sauce</ingred>": 250, "<ingred>tea</ingred>": 251, "<ingred>tequila</ingred>": 252, "<ingred>thyme</ingred>": 253, "<ingred>tia-maria</ingred>": 254, "<ingred>tomato-juice</ingred>": 255, "<ingred>tonic-water</ingred>": 256, "<ingred>triple-sec</ingred>": 257, "<ingred>tropicana</ingred>": 258, "<ingred>vanilla-extract</ingred>": 259, "<ingred>vanilla-ice-cream</ingred>": 260, "<ingred>vanilla-syrup</ingred>": 261, "<ingred>vermouth</ingred>": 262, "<ingred>vodka</ingred>": 263, "<ingred>water</ingred>": 264, "<ingred>whipped-cream</ingred>": 265, "<ingred>whipping-cream</ingred>": 266, "<ingred>whiskey</ingred>": 267, "<ingred>whisky</ingred>": 268, "<ingred>white-creme-de-menthe</ingred>": 269, "<ingred>white-rum</ingred>": 270, "<ingred>wild-turkey</ingred>": 271, "<ingred>wine</ingred>": 272, "<ingred>worcestershire-sauce</ingred>": 273, "<ingred>wormwood</ingred>": 274, "<ingred>yellow-chartreuse</ingred>": 275, "<ingred>yukon-jack</ingred>": 276, "<pad>": 0, "<end>": 277}