{"<amt>0.021 part</amt>": 1, "<amt>0.042 part</amt>": 2, "<amt>0.083 part</amt>": 3, "<amt>0.167 glass</amt>": 4, "<amt>0.167 part</amt>": 5, "<amt>0.188 part</amt>": 6, "<amt>0.2 part</amt>": 7, "<amt>0.208 part</amt>": 8, "<amt>0.25 glass</amt>": 9, "<amt>0.25 part</amt>": 10, "<amt>0.25</amt>": 11, "<amt>0.333 part</amt>": 12, "<amt>0.375 part</amt>": 13, "<amt>0.4 part</amt>": 14, "<amt>0.5 can</amt>": 15, "<amt>0.5 glass</amt>": 16, "<amt>0.5 part</amt>": 17, "<amt>0.5 slice</amt>": 18, "<amt>0.5</amt>": 19, "<amt>0.667 part</amt>": 20, "<amt>0.75 bottle</amt>": 21, "<amt>0.75 glass</amt>": 22, "<amt>0.75 part</amt>": 23, "<amt>0.833 part</amt>": 24, "<amt>1 bottle</amt>": 25, "<amt>1 can</amt>": 26, "<amt>1 cube</amt>": 27, "<amt>1 dash</amt>": 28, "<amt>1 drop</amt>": 29, "<amt>1 large sprig</amt>": 30, "<amt>1 long strip</amt>": 31, "<amt>1 package</amt>": 32, "<amt>1 part</amt>": 33, "<amt>1 piece</amt>": 34, "<amt>1 pinch</amt>": 35, "<amt>1 slice</amt>": 36, "<amt>1 splash</amt>": 37, "<amt>1 sprig</amt>": 38, "<amt>1 twist</amt>": 39, "<amt>1 wedge</amt>": 40, "<amt>1 whole</amt>": 41, "<amt>1.167 parts</amt>": 42, "<amt>1.25 parts</amt>": 43, "<amt>1.333 parts</amt>": 44, "<amt>1.5 parts</amt>": 45, "<amt>1.667 parts</amt>": 46, "<amt>1.75 parts</amt>": 47, "<amt>10</amt>": 48, "<amt>1</amt>": 49, "<amt>2 dashes</amt>": 50, "<amt>2 drop</amt>": 51, "<amt>2 drops</amt>": 52, "<amt>2 part</amt>": 53, "<amt>2 parts</amt>": 54, "<amt>2 pinches</amt>": 55, "<amt>2 scoops</amt>": 56, "<amt>2 splashes</amt>": 57, "<amt>2 spoons</amt>": 58, "<amt>2 sprigs</amt>": 59, "<amt>2 wedges</amt>": 60, "<amt>2.25 parts</amt>": 61, "<amt>2.333 parts</amt>": 62, "<amt>2.5 parts</amt>": 63, "<amt>2.625 parts</amt>": 64, "<amt>2.667 parts</amt>": 65, "<amt>2</amt>": 66, "<amt>3 dashes</amt>": 67, "<amt>3 drops</amt>": 68, "<amt>3 parts</amt>": 69, "<amt>3.333 parts</amt>": 70, "<amt>3.75 parts</amt>": 71, "<amt>3</amt>": 72, "<amt>4 dashes</amt>": 73, "<amt>4 drops</amt>": 74, "<amt>4 parts</amt>": 75, "<amt>4 whole</amt>": 76, "<amt>4</amt>": 77, "<amt>5 parts</amt>": 78, "<amt>5.333 parts</amt>": 79, "<amt>50 gr</amt>": 80, "<amt>5</amt>": 81, "<amt>6 parts</amt>": 82, "<amt>6.667 parts</amt>": 83, "<amt>6</amt>": 84, "<amt>7 drops</amt>": 85, "<amt>7.5 parts</amt>": 86, "<amt>8 cubes</amt>": 87, "<amt>8 parts</amt>": 88, "<amt>8</amt>": 89, "<amt>add</amt>": 90, "<amt>cubes</amt>": 91, "<amt>dash</amt>": 92, "<amt>fill</amt>": 93, "<amt>float</amt>": 94, "<amt>garnish</amt>": 95, "<amt>pinch</amt>": 96, "<amt>splash</amt>": 97, "<amt>sprig</amt>": 98, "<amt>to fill</amt>": 99, "<amt>to taste</amt>": 100, "<amt>top</amt>": 101, "<amt>twist</amt>": 102, "<amt>whole</amt>": 103, "<ingred>151-proof-rum</ingred>": 104, "<ingred>7-up</ingred>": 105, "<ingred>absinthe</ingred>": 106, "<ingred>absolut-citron</ingred>": 107, "<ingred>absolut-kurant</ingred>": 108, "<ingred>absolut-peppar</ingred>": 109, "<ingred>absolut-vodka</ingred>": 110, "<ingred>advocaat</ingred>": 111, "<ingred>agave-syrup</ingred>": 112, "<ingred>ale</ingred>": 113, "<ingred>amaretto</ingred>": 114, "<ingred>amaro-montenegro</ingred>": 115, "<ingred>angostura-bitters</ingred>": 116, "<ingred>anis</ingred>": 117, "<ingred>anise</ingred>": 118, "<ingred>anisette</ingred>": 119, "<ingred>aperol</ingred>": 120, "<ingred>apfelkorn</ingred>": 121, "<ingred>apple-brandy</ingred>": 122, "<ingred>apple-juice</ingred>": 123, "<ingred>apple-schnapps</ingred>": 124, "<ingred>apple</ingred>": 125, "<ingred>applejack</ingred>": 126, "<ingred>apricot-brandy</ingred>": 127, "<ingred>apricot-nectar</ingred>": 128, "<ingred>a\u00f1ejo-rum</ingred>": 129, "<ingred>bacardi-limon</ingred>": 130, "<ingred>baileys-irish-cream</ingred>": 131, "<ingred>banana-liqueur</ingred>": 132, "<ingred>banana</ingred>": 133, "<ingred>basil</ingred>": 134, "<ingred>beer</ingred>": 135, "<ingred>benedictine</ingred>": 136, "<ingred>berries</ingred>": 137, "<ingred>bitter-lemon</ingred>": 138, "<ingred>bitters</ingred>": 139, "<ingred>blackberries</ingred>": 140, "<ingred>blackberry-brandy</ingred>": 141, "<ingred>blackstrap-rum</ingred>": 142, "<ingred>blended-scotch</ingred>": 143, "<ingred>blended-whiskey</ingred>": 144, "<ingred>blood-orange</ingred>": 145, "<ingred>blue-curacao</ingred>": 146, "<ingred>blueberries</ingred>": 147, "<ingred>bourbon</ingred>": 148, "<ingred>brandy</ingred>": 149, "<ingred>brown-sugar</ingred>": 150, "<ingred>butterscotch-schnapps</ingred>": 151, "<ingred>cachaca</ingred>": 152, "<ingred>campari</ingred>": 153, "<ingred>candy</ingred>": 154, "<ingred>cantaloupe</ingred>": 155, "<ingred>carbonated-water</ingred>": 156, "<ingred>cardamom</ingred>": 157, "<ingred>celery-salt</ingred>": 158, "<ingred>chambord-raspberry-liqueur</ingred>": 159, "<ingred>champagne</ingred>": 160, "<ingred>cherry-brandy</ingred>": 161, "<ingred>cherry-heering</ingred>": 162, "<ingred>cherry-juice</ingred>": 163, "<ingred>cherry</ingred>": 164, "<ingred>chocolate-ice-cream</ingred>": 165, "<ingred>chocolate-liqueur</ingred>": 166, "<ingred>chocolate-sauce</ingred>": 167, "<ingred>cinnamon</ingred>": 168, "<ingred>cloves</ingred>": 169, "<ingred>club-soda</ingred>": 170, "<ingred>coca-cola</ingred>": 171, "<ingred>coconut-liqueur</ingred>": 172, "<ingred>coconut-milk</ingred>": 173, "<ingred>coconut-rum</ingred>": 174, "<ingred>coffee-brandy</ingred>": 175, "<ingred>coffee-liqueur</ingred>": 176, "<ingred>coffee</ingred>": 177, "<ingred>cognac</ingred>": 178, "<ingred>cointreau</ingred>": 179, "<ingred>condensed-milk</ingred>": 180, "<ingred>coriander</ingred>": 181, "<ingred>corona</ingred>": 182, "<ingred>cranberry-juice</ingred>": 183, "<ingred>cranberry-vodka</ingred>": 184, "<ingred>cream-of-coconut</ingred>": 185, "<ingred>cream</ingred>": 186, "<ingred>creme-de-banane</ingred>": 187, "<ingred>creme-de-cacao</ingred>": 188, "<ingred>creme-de-cassis</ingred>": 189, "<ingred>creme-de-mure</ingred>": 190, "<ingred>crown-royal</ingred>": 191, "<ingred>cucumber</ingred>": 192, "<ingred>curacao</ingred>": 193, "<ingred>dark-rum</ingred>": 194, "<ingred>demerara-sugar</ingred>": 195, "<ingred>dr</ingred>": 196, "<ingred>drambuie</ingred>": 197, "<ingred>dry-vermouth</ingred>": 198, "<ingred>dubonnet-rouge</ingred>": 199, "<ingred>egg-white</ingred>": 200, "<ingred>egg-yolk</ingred>": 201, "<ingred>egg</ingred>": 202, "<ingred>elderflower-cordial</ingred>": 203, "<ingred>erin-cream</ingred>": 204, "<ingred>espresso</ingred>": 205, "<ingred>everclear</ingred>": 206, "<ingred>falernum</ingred>": 207, "<ingred>figs</ingred>": 208, "<ingred>firewater</ingred>": 209, "<ingred>frangelico</ingred>": 210, "<ingred>fresh-lemon-juice</ingred>": 211, "<ingred>fresh-lime-juice</ingred>": 212, "<ingred>fruit-punch</ingred>": 213, "<ingred>galliano</ingred>": 214, "<ingred>gin</ingred>": 215, "<ingred>ginger-ale</ingred>": 216, "<ingred>ginger-beer</ingred>": 217, "<ingred>ginger-syrup</ingred>": 218, "<ingred>ginger</ingred>": 219, "<ingred>godiva-liqueur</ingred>": 220, "<ingred>gold-rum</ingred>": 221, "<ingred>gold-tequila</ingred>": 222, "<ingred>goldschlager</ingred>": 223, "<ingred>grain-alcohol</ingred>": 224, "<ingred>grand-marnier</ingred>": 225, "<ingred>grape-juice</ingred>": 226, "<ingred>grape-soda</ingred>": 227, "<ingred>grapefruit-juice</ingred>": 228, "<ingred>grapes</ingred>": 229, "<ingred>green-chartreuse</ingred>": 230, "<ingred>green-creme-de-menthe</ingred>": 231, "<ingred>grenadine</ingred>": 232, "<ingred>guinness-stout</ingred>": 233, "<ingred>half-and-half</ingred>": 234, "<ingred>heavy-cream</ingred>": 235, "<ingred>honey-syrup</ingred>": 236, "<ingred>honey</ingred>": 237, "<ingred>hot-chocolate</ingred>": 238, "<ingred>hot-damn</ingred>": 239, "<ingred>hpnotiq</ingred>": 240, "<ingred>ice</ingred>": 241, "<ingred>iced-tea</ingred>": 242, "<ingred>irish-cream</ingred>": 243, "<ingred>irish-whiskey</ingred>": 244, "<ingred>islay-single-malt-scotch</ingred>": 245, "<ingred>jack-daniels</ingred>": 246, "<ingred>jim-beam</ingred>": 247, "<ingred>j\u00e4germeister</ingred>": 248, "<ingred>kahlua</ingred>": 249, "<ingred>kirschwasser</ingred>": 250, "<ingred>kiwi-liqueur</ingred>": 251, "<ingred>kiwi</ingred>": 252, "<ingred>kool-aid</ingred>": 253, "<ingred>kummel</ingred>": 254, "<ingred>lager</ingred>": 255, "<ingred>lavender</ingred>": 256, "<ingred>lemon-juice</ingred>": 257, "<ingred>lemon-lime-soda</ingred>": 258, "<ingred>lemon-peel</ingred>": 259, "<ingred>lemon-vodka</ingred>": 260, "<ingred>lemon</ingred>": 261, "<ingred>lemonade</ingred>": 262, "<ingred>licorice-root</ingred>": 263, "<ingred>light-cream</ingred>": 264, "<ingred>light-rum</ingred>": 265, "<ingred>lillet-blanc</ingred>": 266, "<ingred>lillet</ingred>": 267, "<ingred>lime-juice-cordial</ingred>": 268, "<ingred>lime-juice</ingred>": 269, "<ingred>lime-peel</ingred>": 270, "<ingred>lime-vodka</ingred>": 271, "<ingred>lime</ingred>": 272, "<ingred>limeade</ingred>": 273, "<ingred>malibu-rum</ingred>": 274, "<ingred>mango</ingred>": 275, "<ingred>maple-syrup</ingred>": 276, "<ingred>maraschino-cherry</ingred>": 277, "<ingred>maraschino-liqueur</ingred>": 278, "<ingred>melon-liqueur</ingred>": 279, "<ingred>mezcal</ingred>": 280, "<ingred>midori-melon-liqueur</ingred>": 281, "<ingred>milk</ingred>": 282, "<ingred>mint</ingred>": 283, "<ingred>mountain-dew</ingred>": 284, "<ingred>nutmeg</ingred>": 285, "<ingred>olive</ingred>": 286, "<ingred>orange-bitters</ingred>": 287, "<ingred>orange-curacao</ingred>": 288, "<ingred>orange-juice</ingred>": 289, "<ingred>orange-peel</ingred>": 290, "<ingred>orange-spiral</ingred>": 291, "<ingred>orange</ingred>": 292, "<ingred>oreo-cookie</ingred>": 293, "<ingred>orgeat-syrup</ingred>": 294, "<ingred>ouzo</ingred>": 295, "<ingred>papaya</ingred>": 296, "<ingred>passion-fruit-juice</ingred>": 297, "<ingred>passion-fruit-syrup</ingred>": 298, "<ingred>passoa</ingred>": 299, "<ingred>peach-bitters</ingred>": 300, "<ingred>peach-brandy</ingred>": 301, "<ingred>peach-nectar</ingred>": 302, "<ingred>peach-schnapps</ingred>": 303, "<ingred>peachtree-schnapps</ingred>": 304, "<ingred>pepper</ingred>": 305, "<ingred>pepsi-cola</ingred>": 306, "<ingred>pernod</ingred>": 307, "<ingred>peychaud-bitters</ingred>": 308, "<ingred>pineapple-juice</ingred>": 309, "<ingred>pineapple-syrup</ingred>": 310, "<ingred>pineapple</ingred>": 311, "<ingred>pisang-ambon</ingred>": 312, "<ingred>pisco</ingred>": 313, "<ingred>pomegranate-juice</ingred>": 314, "<ingred>port</ingred>": 315, "<ingred>powdered-sugar</ingred>": 316, "<ingred>prosecco</ingred>": 317, "<ingred>raspberry-liqueur</ingred>": 318, "<ingred>raspberry-syrup</ingred>": 319, "<ingred>raspberry-vodka</ingred>": 320, "<ingred>red-chili-flakes</ingred>": 321, "<ingred>red-wine</ingred>": 322, "<ingred>ricard</ingred>": 323, "<ingred>root-beer</ingred>": 324, "<ingred>rosemary-syrup</ingred>": 325, "<ingred>rosemary</ingred>": 326, "<ingred>rosso-vermouth</ingred>": 327, "<ingred>ruby-port</ingred>": 328, "<ingred>rum</ingred>": 329, "<ingred>rye-whiskey</ingred>": 330, "<ingred>salt</ingred>": 331, "<ingred>salted-chocolate</ingred>": 332, "<ingred>sambuca</ingred>": 333, "<ingred>sarsaparilla</ingred>": 334, "<ingred>schweppes-russchian</ingred>": 335, "<ingred>scotch</ingred>": 336, "<ingred>sherry</ingred>": 337, "<ingred>sloe-gin</ingred>": 338, "<ingred>soda-water</ingred>": 339, "<ingred>sour-mix</ingred>": 340, "<ingred>southern-comfort</ingred>": 341, "<ingred>spiced-rum</ingred>": 342, "<ingred>sprite</ingred>": 343, "<ingred>st</ingred>": 344, "<ingred>strawberries</ingred>": 345, "<ingred>strawberry-liqueur</ingred>": 346, "<ingred>strawberry-schnapps</ingred>": 347, "<ingred>sugar-syrup</ingred>": 348, "<ingred>sugar</ingred>": 349, "<ingred>surge</ingred>": 350, "<ingred>sweet-and-sour</ingred>": 351, "<ingred>sweet-vermouth</ingred>": 352, "<ingred>tabasco-sauce</ingred>": 353, "<ingred>tea</ingred>": 354, "<ingred>tequila</ingred>": 355, "<ingred>thyme</ingred>": 356, "<ingred>tia-maria</ingred>": 357, "<ingred>tomato-juice</ingred>": 358, "<ingred>tonic-water</ingred>": 359, "<ingred>triple-sec</ingred>": 360, "<ingred>tropicana</ingred>": 361, "<ingred>vanilla-extract</ingred>": 362, "<ingred>vanilla-ice-cream</ingred>": 363, "<ingred>vanilla-syrup</ingred>": 364, "<ingred>vermouth</ingred>": 365, "<ingred>vodka</ingred>": 366, "<ingred>water</ingred>": 367, "<ingred>whipped-cream</ingred>": 368, "<ingred>whipping-cream</ingred>": 369, "<ingred>whiskey</ingred>": 370, "<ingred>whisky</ingred>": 371, "<ingred>white-creme-de-menthe</ingred>": 372, "<ingred>white-rum</ingred>": 373, "<ingred>wild-turkey</ingred>": 374, "<ingred>wine</ingred>": 375, "<ingred>worcestershire-sauce</ingred>": 376, "<ingred>wormwood</ingred>": 377, "<ingred>yellow-chartreuse</ingred>": 378, "<ingred>yukon-jack</ingred>": 379, "<pad>": 0, "<end>": 380}