{"<amt>0.021 part</amt>": 1, "<amt>0.042 part</amt>": 2, "<amt>0.083 part</amt>": 3, "<amt>0.167 glass</amt>": 4, "<amt>0.167 part</amt>": 5, "<amt>0.188 part</amt>": 6, "<amt>0.2 part</amt>": 7, "<amt>0.208 part</amt>": 8, "<amt>0.25 glass</amt>": 9, "<amt>0.25 part</amt>": 10, "<amt>0.25</amt>": 11, "<amt>0.333 part</amt>": 12, "<amt>0.375 part</amt>": 13, "<amt>0.4 part</amt>": 14, "<amt>0.5 can</amt>": 15, "<amt>0.5 glass</amt>": 16, "<amt>0.5 part</amt>": 17, "<amt>0.5 slice</amt>": 18, "<amt>0.5</amt>": 19, "<amt>0.667 part</amt>": 20, "<amt>0.75 bottle</amt>": 21, "<amt>0.75 glass</amt>": 22, "<amt>0.75 part</amt>": 23, "<amt>0.833 part</amt>": 24, "<amt>1 bottle</amt>": 25, "<amt>1 can</amt>": 26, "<amt>1 cube</amt>": 27, "<amt>1 dash</amt>": 28, "<amt>1 drop</amt>": 29, "<amt>1 large sprig</amt>": 30, "<amt>1 long strip</amt>": 31, "<amt>1 package</amt>": 32, "<amt>1 part</amt>": 33, "<amt>1 piece</amt>": 34, "<amt>1 pinch</amt>": 35, "<amt>1 slice</amt>": 36, "<amt>1 splash</amt>": 37, "<amt>1 sprig</amt>": 38, "<amt>1 twist</amt>": 39, "<amt>1 wedge</amt>": 40, "<amt>1 whole</amt>": 41, "<amt>1.167 parts</amt>": 42, "<amt>1.25 parts</amt>": 43, "<amt>1.333 parts</amt>": 44, "<amt>1.5 parts</amt>": 45, "<amt>1.667 parts</amt>": 46, "<amt>1.75 parts</amt>": 47, "<amt>10</amt>": 48, "<amt>1</amt>": 49, "<amt>2 dashes</amt>": 50, "<amt>2 drop</amt>": 51, "<amt>2 drops</amt>": 52, "<amt>2 part</amt>": 53, "<amt>2 parts</amt>": 54, "<amt>2 pinches</amt>": 55, "<amt>2 scoops</amt>": 56, "<amt>2 splashes</amt>": 57, "<amt>2 spoons</amt>": 58, "<amt>2 sprigs</amt>": 59, "<amt>2 wedges</amt>": 60, "<amt>2.25 parts</amt>": 61, "<amt>2.333 parts</amt>": 62, "<amt>2.5 parts</amt>": 63, "<amt>2.625 parts</amt>": 64, "<amt>2.667 parts</amt>": 65, "<amt>2</amt>": 66, "<amt>3 dashes</amt>": 67, "<amt>3 drops</amt>": 68, "<amt>3 parts</amt>": 69, "<amt>3.333 parts</amt>": 70, "<amt>3.75 parts</amt>": 71, "<amt>3</amt>": 72, "<amt>4 dashes</amt>": 73, "<amt>4 drops</amt>": 74, "<amt>4 parts</amt>": 75, "<amt>4 whole</amt>": 76, "<amt>4</amt>": 77, "<amt>5 parts</amt>": 78, "<amt>5.333 parts</amt>": 79, "<amt>50 gr</amt>": 80, "<amt>5</amt>": 81, "<amt>6 parts</amt>": 82, "<amt>6.667 parts</amt>": 83, "<amt>6</amt>": 84, "<amt>7 drops</amt>": 85, "<amt>7.5 parts</amt>": 86, "<amt>8 cubes</amt>": 87, "<amt>8 parts</amt>": 88, "<amt>8</amt>": 89, "<amt>add</amt>": 90, "<amt>cubes</amt>": 91, "<amt>dash</amt>": 92, "<amt>fill</amt>": 93, "<amt>float</amt>": 94, "<amt>garnish</amt>": 95, "<amt>pinch</amt>": 96, "<amt>splash</amt>": 97, "<amt>sprig</amt>": 98, "<amt>to fill</amt>": 99, "<amt>to taste</amt>": 100, "<amt>top</amt>": 101, "<amt>twist</amt>": 102, "<amt>whole</amt>": 103, "<pad>": 0, "<end>": 104}